In [ ]:
-- Q1 Create a table rentals_may to store the data from rental
-- table with information for the month of May. 
-- #https://dev.mysql.com/doc/refman/8.0/en/create-table-select.html
use sakila; -- to guratnee you are using the right schema 
Create table sakila.rentals_may like sakila.rental; 

-- insert into (table name)
use sakila;
insert into rentals_may
select *
from sakila.rental
where date_format(rental_date,"%b") = "May"
;

In [ ]:
- Q2Create a table rentals_june to store the data from rental table 
-- with information for the month of June.
create table sakila.rentals_june like sakila.rental; 

use sakila;
insert into rentals_june
select * 
from sakila.rental
where date_format(rental_date,"%b")="Jun" 
-- didnt work before because of the way you wrote the month 
-- have to write the abbreviated version 
; 
-- 
select * from sakila.rentals_june; 

-- Check the number of rentals for each customer for May. 
select * from sakila.rentals_may ; 
select customer_id,count(customer_id) as num_of_ren_by_cus
from sakila.rentals_may
group by customer_id;

-- Check the number of rentals for each customer for June.
select * from sakila.rentals_june ;
select customer_id,count(customer_id) as num_of_ren_by_cus
from sakila.rentals_june
group by customer_id;

In [ ]:
pip install pymysql

In [3]:
pip install sqlalchemy

Requirement already satisfied: sqlalchemy in /Users/Bijou/opt/anaconda3/lib/python3.8/site-packages (1.4.7)
Requirement already satisfied: greenlet!=0.4.17 in /Users/Bijou/opt/anaconda3/lib/python3.8/site-packages (from sqlalchemy) (1.0.0)
Note: you may need to restart the kernel to use updated packages.

In [1]:
from sqlalchemy import create_engine
import pandas as pd
import getpass  
password = getpass.getpass()

········

In [2]:
connection_string = 'mysql+pymysql://root:' + password + '@localhost/sakila'
engine = create_engine(connection_string) 
data = pd.read_sql_query('SELECT * FROM sakila.rentals_may', engine) 

data.head()

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id,last_update
0,1,2005-05-24 22:53:30,367,130,2005-05-26 22:04:30,1,2006-02-15 21:30:53
1,2,2005-05-24 22:54:33,1525,459,2005-05-28 19:40:33,1,2006-02-15 21:30:53
2,3,2005-05-24 23:03:39,1711,408,2005-06-01 22:12:39,1,2006-02-15 21:30:53
3,4,2005-05-24 23:04:41,2452,333,2005-06-03 01:43:41,2,2006-02-15 21:30:53
4,5,2005-05-24 23:05:21,2079,222,2005-06-02 04:33:21,1,2006-02-15 21:30:53

In [6]:
connection_string = 'mysql+pymysql://root:' + password + '@localhost/sakila'
engine = create_engine(connection_string) 
data = pd.read_sql_query('SELECT * FROM sakila.rentals_june', engine) 

data.head()

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id,last_update
0,1158,2005-06-14 22:53:33,1632,416,2005-06-18 21:37:33,2,2006-02-15 21:30:53
1,1159,2005-06-14 22:55:13,4395,516,2005-06-17 02:11:13,1,2006-02-15 21:30:53
2,1160,2005-06-14 23:00:34,2795,239,2005-06-18 01:58:34,2,2006-02-15 21:30:53
3,1161,2005-06-14 23:07:08,1690,285,2005-06-21 17:12:08,1,2006-02-15 21:30:53
4,1162,2005-06-14 23:09:38,987,310,2005-06-23 22:00:38,1,2006-02-15 21:30:53

In [ ]:
#Check the number of rentals for each customer for May

In [4]:
engine.execute("USE sakila") 
#make query into a variable so you can simplify each query from then on so it isnt as messy 
query = '''select customer_id,count(customer_id) as num_of_ren_by_cus
from sakila.rentals_may
group by customer_id;'''
    #you can use all the queries clauses you used in mysql in here 
    #you do have to format the querie so that python understands the sql syntax since sql does not care for spaces but python does 
    #you can also use query='''slkdjfldskjfljd''' to get around the backslash issue 
data = pd.read_sql_query(query, engine)
data.head()

   customer_id  num_of_ren_by_cus
0            1                  2
1            2                  1
2            3                  2
3            5                  3
4            6                  3

In [ ]:
#Check the number of rentals for each customer for June

In [7]:
engine.execute("USE sakila") 

query = '''select customer_id,count(customer_id) as num_of_ren_by_cus
from sakila.rentals_june
group by customer_id;'''

data = pd.read_sql_query(query, engine)
data.head()

   customer_id  num_of_ren_by_cus
0            1                  7
1            2                  1
2            3                  4
3            4                  6
4            5                  5

In [14]:
#CLASS ANSWEr??
#query = '''select customer_id,count(customer_id) as num_of_ren_by_cus

#from sakila.rentals_june
#group by customer_id;''' 
#pd.read_sql(engine.execute(query),engine)

In [ ]:
#Write a function that checks if customer borrowed more or less films
#in the month of June as compared to May.

In [ ]:
#Hint: For this part, you can create a join between the two dataframes 
#created before, using the merge function available for pandas dataframes.
#Here is a link to the documentation for the merge function.

In [ ]:
for item

In [10]:
data_may= pd.read_sql_query('select * from rentals_may',engine)
data_june= pd.read_sql_query('select * from rentals_june',engine)

In [11]:
data_may.head()

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id,last_update
0,1,2005-05-24 22:53:30,367,130,2005-05-26 22:04:30,1,2006-02-15 21:30:53
1,2,2005-05-24 22:54:33,1525,459,2005-05-28 19:40:33,1,2006-02-15 21:30:53
2,3,2005-05-24 23:03:39,1711,408,2005-06-01 22:12:39,1,2006-02-15 21:30:53
3,4,2005-05-24 23:04:41,2452,333,2005-06-03 01:43:41,2,2006-02-15 21:30:53
4,5,2005-05-24 23:05:21,2079,222,2005-06-02 04:33:21,1,2006-02-15 21:30:53

In [12]:
data_june.head()

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id,last_update
0,1158,2005-06-14 22:53:33,1632,416,2005-06-18 21:37:33,2,2006-02-15 21:30:53
1,1159,2005-06-14 22:55:13,4395,516,2005-06-17 02:11:13,1,2006-02-15 21:30:53
2,1160,2005-06-14 23:00:34,2795,239,2005-06-18 01:58:34,2,2006-02-15 21:30:53
3,1161,2005-06-14 23:07:08,1690,285,2005-06-21 17:12:08,1,2006-02-15 21:30:53
4,1162,2005-06-14 23:09:38,987,310,2005-06-23 22:00:38,1,2006-02-15 21:30:53

In [20]:
#putting the tables together 
#we want a right join because we want to focus on june 
data=data_may.merge(data_june, how='right',left_on='customer_id',right_on='customer_id' ) 
#name of the key you want to merge on 
#then tells you which will be places on the left and on the right

In [22]:
data_filter = data[pd.isna(data['rental_id_x'])== True]

In [19]:
data.isna().sum()
#where there are nulls it tells you where customers that ordered 
#in june and not in may

rental_id_x       328
rental_date_x     328
inventory_id_x    328
customer_id         0
return_date_x     328
staff_id_x        328
last_update_x     328
rental_id_y         0
rental_date_y       0
inventory_id_y      0
return_date_y       0
staff_id_y          0
last_update_y       0
dtype: int64

In [23]:
data_filter['customer_id'].nunique()

78

In [ ]:
query1= #check screen shots 
i would think you would type it into sql june 
greater than may and then only show thoes customers ?

In [ ]:
create a join between the tables with the filtered number of rental data

In [ ]:
save the filter query to a named variable by month 
june = query1 engine?